#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_storage_bucket.auto-expire: Refreshing state... [id=ms-one-no-public-access-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.auto-expire must be replaced
-/+ resource "google_storage_bucket" "auto-expire" {
      - default_event_based_hold    = false -> null
      ~ id                          = "ms-one-no-public-access-bucket" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "ms-one-no-public-access-bucket" -> "msa-one-no-public-access-bucket" # forces replacement
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/ms-one-no-public-access-bucket" -> (known after apply)
      ~ uniform_bucket_level_access = false -> (known after apply)
      ~ url                         = "gs://ms-one-no-public-access-bucket" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @muralisathenapally, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*